tutorials/text.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
   <Header>
      <AuthenticationInfo xmlns="urn:LH_Charter_Incident_Interface_Stage">
         <userName>lighthouseapi</userName>
         <password>lighthouseapi</password>
      </AuthenticationInfo>
   </Header>
   <Body>
      <Create_ImpactMain_Oper_0 xmlns="urn:LH_CHR:IMP:ImpactMain">
         <Submitter>lighthouseapi</Submitter>
         <Assigned_To>Eric Burch</Assigned_To>
         <Status>Created</Status>
         <Short_Description>create impact</Short_Description>
         <SourceSchema>HPD:Help Desk</SourceSchema>
         <Process_ID>A0001</Process_ID>
         <z1D_Action>CREATE</z1D_Action>
         <SourceRequestID>INC000000332815</SourceRequestID>
         <Start_Time>2018-02-02T13:24:17-05:00</Start_Time>
         <Subscribers_Affected>38</Subscribers_Affected>
         <End_Time>0001-01-01T00:00:00Z</End_Time>
         <SourceInstanceID>WIGAA5V0GWMRHAPGK5KXPFNTTDPLR0</SourceInstanceID>
         <Customer_Impacting>Yes</Customer_Impacting>
         <Condition>HazCon</Condition>
      </Create_ImpactMain_Oper_0>
   </Body>
</Envelope>

lh req: &{CallDeflection:true OrderType:Outage-Unplanned DispatchTechSupervisor: LighthouseWorkOrderID:1132532 RemedyLoginID:P2141720 FirstName:Adam LastName:Park Region:soh Ma:mwc Hub:04 Node:04091 Summary:ZVOutage AssignedGroup:ROC-SOH Assignee:Naomi Deutsch IncidentStartTime:2018-04-09T09:25:10-04:00 EventVerificationStatus: SubscribersAffected:155 PotentialAffected:0 InfrastructureEventType: AreaType:Node WorkInfoType: WorkInfoSummary: WorkInfoNotes: CommunicationSource: WorkInfoViewAccess: ServicesAffected:map[High Speed Internet:{Actual:155 Symptom:No connectivity} Phone Calls:{Actual:107 Symptom:No dial tone} Video Channels:{Actual:88 Symptom:Black screen}] Relationship:[{Region:Southern Ohio MA:Midwest Central Hub:HILLTOP : 4 Node:04-091}]}


<Action>MODIFY</Action>
         <Incident_Number>INC000000334254</Incident_Number>
         <Status>In Pogress</Status>
         <Categorization_Tier_1>HFC</Categorization_Tier_1>
         <Categorization_Tier_2>Refer to Maintenance</Categorization_Tier_2>
         <Categorization_Tier_3>Demand Referral - Other</Categorization_Tier_3>
         <Product_Categorization_Tier_1>HFC Repair</Product_Categorization_Tier_1>
         <Severity>Low</Severity>
         <Condition>Outage</Condition>
         <Summary>NES - CNY - Multi Hub - Multi Node - OUTAGE - L</Summary>
         <Impact>4-Minor/Localized</Impact>
         <Urgency>4-Low</Urgency>
         <Notes>"Dispatched" Patrick Nice, Yama Safi, on "LH Work Order " 179
testing update
testing update</Notes>
         <Incident_Start_Time>2018-02-02T13:24:17-05:00</Incident_Start_Time>
      </Update_Incident>